api/app/controllers/todos_controller.rb

    def update
        todo = user.todos.find(params[:id]).update(todo_params)
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Update endpoints"], ["updated_at", "2023-03-25 06:48:19.450081"], ["id", 2]]

    def destroy
        #todo = user.todos.find(params[:id]).destroy
        user.todos.find(params[:id]).destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]